{
  "backend/main.mo": "Motoko actor managing user profiles and referee booking requests with admin- and user-level access control checks.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style summaries of all major frontend files describing functionality, UI components, hooks, and configuration.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide covering prerequisites, build steps, DNS setup, and verification procedures.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode values, and base styles.",
  "frontend/index.html": "HTML entry with full SEO metadata, runtime base URL handling, and structured data for the site.",
  "frontend/LIVE_URLS.md": "Documentation of production URLs, canister IDs, and deployment validation checklists.",
  "frontend/public/robots.txt": "Allows all crawlers and points to the sitemap URL.",
  "frontend/public/sitemap.xml": "Sitemap listing the homepage with update frequency and priority.",
  "frontend/SEO.md": "SEO configuration guide detailing meta tags, structured data, sitemap, robots.txt, and Search Console setup.",
  "frontend/src/App.tsx": "Main React app that tracks page view and renders header, landing page, and footer.",
  "frontend/src/components/admin/QuickRequestsAdminView.tsx": "Admin view that loads referee requests, handles access errors, and supports copying request details.",
  "frontend/src/components/branding/Logo.tsx": "Logo component rendering the site logo with configurable sizes.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing branding, navigation shortcuts, contact info, and hours.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, navigation links, admin access, and mobile menu.",
  "frontend/src/components/lead/ChatbotLeadWidget.tsx": "Interactive chatbot widget for collecting referee request details and submitting them.",
  "frontend/src/components/marketing/ContactLeadSection.tsx": "Contact form component handling quick request submission, validation, copy-to-clipboard actions, and success/error states.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero section with marketing text, stats, images, and buttons that smooth-scroll to other sections.",
  "frontend/src/components/marketing/ProcessSection.tsx": "Shows a step-by-step process explanation with icons and a call‑to‑action scroll button.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Lists available officiating services with icons and includes a sports coverage section with imagery.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider managing authentication state, login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for submitting referee and quick requests using react-query and fetching admin status or all requests from an actor.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, typography rules, and utility classes for the site's theme.",
  "frontend/src/main.tsx": "Initializes React app, wraps it with react-query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/LandingPage.tsx": "Landing page assembling marketing sections, admin view when authorized, and a chatbot widget.",
  "frontend/src/utils/analytics/ga4.ts": "GA4 analytics wrapper providing safe event, page view, and conversion tracking with no-ops when disabled.",
  "frontend/src/utils/publicSiteBaseUrl.ts": "Utilities for resolving and normalizing the site's public base URL and hostname, with env and fallback logic.",
  "frontend/src/utils/siteVersion.ts": "Returns the site version from env variables with a default value of '8'.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and enabled plugins.",
  "project_state.json": "Tracks the project’s versioned state, existing features, known issues, and pending admin‑access improvements for SwiftSport Hub. Identifies an admin‑related loading error and lists feature and requirement metadata."
}