{
  "backend/main.mo": "Motoko canister managing user profiles and referee booking requests with access control checks for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and tests with high-confidence verification metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including components, hooks, and configuration.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide detailing prerequisites, build steps, and custom-domain setup for swiftsportshub.com.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables, color system, and dark mode settings.",
  "frontend/index.html": "HTML entry point containing metadata and detailed instructions for correct public URL configuration using environment variables.",
  "frontend/LIVE_URLS.md": "Document defining production URLs, canister ID placeholders, and post-deployment verification checklist.",
  "frontend/src/App.tsx": "Root React component composing site header, landing page, and footer in a flex layout.",
  "frontend/src/components/admin/QuickRequestsAdminView.tsx": "Admin view listing referee requests with error handling and copy‑to‑clipboard support for email-ready details.",
  "frontend/src/components/branding/Logo.tsx": "Reusable logo component rendering the SwiftSport image with configurable size classes.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, quick links, contact info, availability hours, and copyright text.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides a sticky header with logo, navigation links, admin visibility logic, and a responsive mobile menu.",
  "frontend/src/components/lead/ChatbotLeadWidget.tsx": "Implements an interactive multi‑step chatbot for collecting referee request details and submitting them via a mutation.",
  "frontend/src/components/marketing/ContactLeadSection.tsx": "Displays contact methods and a quick‑request form with validation and submission handling.",
  "frontend/src/components/marketing/HeroSection.tsx": "Shows the homepage hero content with main messaging, stats, call‑to‑action buttons, and a hero image.",
  "frontend/src/components/marketing/ProcessSection.tsx": "Outlines the officiating request process using a five‑step visual layout with icons and a call‑to‑action.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Renders a marketing services section listing officiating offerings and supported sports with icons and styled cards.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting booking requests, quick requests, checking admin status, and fetching all referee requests.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for a sports-themed color palette and component styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers and loading global styles.",
  "frontend/src/pages/LandingPage.tsx": "Composes the main landing page with marketing sections, admin view, and chatbot widget.",
  "frontend/src/utils/publicSiteBaseUrl.ts": "Provides utilities to resolve and normalize the public site base URL and hostname for consistent external URL generation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters and persist them in sessionStorage, plus utilities to clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, animations, and container settings for the frontend.",
  "project_state.json": "Defines the project’s current state, features, and pending requests for deployment and domain setup."
}