{
  "kind": "build_request",
  "title": "Set site to Website Version 8 (display + configurable build version)",
  "projectName": "SwiftSport Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a configurable website version identifier set to \"8\" and display it in the UI so the site can be clearly identified as “Version 8 of the website”. The version must be configurable via a build-time environment variable (defaulting to 8 if not set).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "version 8 of my website"
        ]
      },
      "acceptanceCriteria": [
        "A build-time env var (e.g., VITE_SITE_VERSION) controls the displayed site version, and when unset the UI defaults to showing version 8.",
        "The site footer displays a small, unobtrusive label such as \"Version 8\" (English text).",
        "The version label renders correctly in both light and dark mode and on mobile + desktop widths."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose the active website version in the document metadata to help operators verify which version is deployed (without changing the public SEO/canonical URL behavior for swiftsportshub.com).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "version 8 of my website"
        ]
      },
      "acceptanceCriteria": [
        "The HTML document includes a machine-readable version indicator (e.g., a meta tag like <meta name=\"application-version\" ...> or equivalent) reflecting the same version shown in the UI.",
        "No changes break or remove the existing runtime canonical/OpenGraph/Twitter URL updating logic that uses VITE_PUBLIC_SITE_BASE_URL."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update deployment documentation to include how to set the website version to 8 (and how to change it later) during deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "version 8 of my website"
        ]
      },
      "acceptanceCriteria": [
        "frontend/DEPLOYMENT.md (or the most appropriate existing deployment doc) includes a short section showing the exact command format to deploy with the version env var set (example includes Version 8).",
        "Docs explicitly state what the default version is when the env var is not provided."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any path listed in frontend.immutablePaths (compose existing UI components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not change the existing public URL configuration behavior (VITE_PUBLIC_SITE_BASE_URL) for canonical/meta URL generation."
  ],
  "nonGoals": [
    "Implementing a true rollback of previously deployed canister WASM or restoring an older on-chain state snapshot from within the app.",
    "Recreating unknown historical “Version 8” page layout/content from prior deployments beyond adding an explicit Version 8 identifier/configuration.",
    "Changing the domain configuration or GoDaddy DNS setup steps."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}