{
  "kind": "build_request",
  "title": "Fix “Failed to load requests” error by gating admin requests view and improving admin detection",
  "projectName": "SwiftSport Hub",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent non-admin visitors from triggering the admin requests fetch by conditionally rendering the Requests Review (admin requests) section only when the current caller is confirmed to be an admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "getting this error \"Failed to load requests. Please try again later or contact support.\" please rectify this"
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin user loads the landing page, the admin Requests Review section is not shown and no request-fetch error banner appears.",
        "When an admin user loads the landing page, the Requests Review section is shown and requests are fetched/displayed.",
        "The header Admin navigation link remains visible only for admins (no regression)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the admin requests query logic so that `getAllRequests()` is only executed when the caller is an admin (avoid calling it for anonymous/non-admin actors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "getting this error \"Failed to load requests. Please try again later or contact support.\" please rectify this"
        ]
      },
      "acceptanceCriteria": [
        "`getAllRequests()` is not called unless admin status has been determined and is true.",
        "React Query no longer enters an error state for the requests query on non-admin sessions.",
        "Admin sessions can still refresh/reload and successfully refetch requests."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend actor exposes a stable admin-check method used by the frontend (`isCallerAdmin`) that returns a boolean without trapping, so the frontend can reliably gate admin-only UI and queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "getting this error \"Failed to load requests. Please try again later or contact support.\" please rectify this"
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a public query method `isCallerAdmin : async Bool` that returns `true` only when `AccessControl.isAdmin` is true for the caller, and otherwise returns `false` (no trap).",
        "Frontend admin detection (`useIsCallerAdmin`) works without throwing/method-missing errors and correctly reflects admin/non-admin status."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve error handling in the admin requests UI so that if an error does occur for an admin, the UI shows a clear, English message plus the underlying error details (safely), and provides an actionable hint for admins about the required admin access mechanism (URL secret token `caffeineAdminToken`) when access is denied.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "getting this error \"Failed to load requests. Please try again later or contact support.\" please rectify this"
        ]
      },
      "acceptanceCriteria": [
        "If access is denied, the UI displays an 'Access Denied' message and includes a hint that admin access requires the `caffeineAdminToken` URL parameter (do not display any actual secret token value).",
        "If another error happens (e.g., network/canister call failure), the UI displays a general failure message and also shows the raw error message text in a secondary/diagnostic line for troubleshooting.",
        "User-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` or any other paths listed in `frontend.immutablePaths`.",
    "Keep all Motoko logic within the single actor in `backend/main.mo`; only add `backend/migration.mo` if a state migration is strictly necessary (it should not be for this change)."
  ],
  "nonGoals": [
    "Do not change the underlying authorization model or who is considered an admin; only prevent erroneous/non-admin fetching and improve reliability of admin detection.",
    "Do not add new authentication providers (only existing Internet Identity + current secret-token initialization flow)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}