{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SwiftSport Hub - Website Version 8 label + metadata",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add build-time configurable site version (default 8) and display an unobtrusive “Version X” label in the footer.",
      "acceptanceCriteria": [
        "A build-time env var (e.g., VITE_SITE_VERSION) controls the displayed site version, and when unset the UI defaults to showing version 8.",
        "The site footer displays a small, unobtrusive label such as \"Version 8\" (English text).",
        "The version label renders correctly in both light and dark mode and on mobile + desktop widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/siteVersion.ts",
          "operation": "create",
          "description": "Create a small utility that reads the build-time env var VITE_SITE_VERSION and returns a normalized display value, defaulting to \"8\" when missing/blank."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Import the site version utility and render a small, unobtrusive \"Version {X}\" label in the footer (styled using existing Tailwind tokens like text-muted-foreground so it works in light/dark modes and responsive layouts)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Expose the active site version in HTML document metadata without altering existing canonical/social URL logic tied to VITE_PUBLIC_SITE_BASE_URL.",
      "acceptanceCriteria": [
        "The HTML document includes a machine-readable version indicator (e.g., a meta tag like <meta name=\"application-version\" ...> or equivalent) reflecting the same version shown in the UI.",
        "No changes break or remove the existing runtime canonical/OpenGraph/Twitter URL updating logic that uses VITE_PUBLIC_SITE_BASE_URL."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a machine-readable version meta tag (e.g., name=\"application-version\") and set its content using the same build-time VITE_SITE_VERSION value with a safe default of \"8\" when not provided. Ensure the existing runtime canonical/OpenGraph/Twitter URL updating logic using VITE_PUBLIC_SITE_BASE_URL remains intact and unchanged in behavior."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update deployment documentation to explain how to set (and later change) the site version via env var, including default behavior.",
      "acceptanceCriteria": [
        "frontend/DEPLOYMENT.md (or the most appropriate existing deployment doc) includes a short section showing the exact command format to deploy with the version env var set (example includes Version 8).",
        "Docs explicitly state what the default version is when the env var is not provided."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add a short section documenting VITE_SITE_VERSION (defaulting to 8 when unset) and include an explicit example deploy command showing VITE_SITE_VERSION=8, plus a note on how to change it later by rebuilding/redeploying with a different value."
        }
      ]
    }
  ]
}