{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Gate admin requests view and prevent non-admin request fetching in SwiftSport Hub",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the Requests Review section only after the current caller is confirmed to be an admin to prevent non-admin fetch errors on the landing page.",
      "acceptanceCriteria": [
        "When a non-admin user loads the landing page, the admin Requests Review section is not shown and no request-fetch error banner appears.",
        "When an admin user loads the landing page, the Requests Review section is shown and requests are fetched/displayed.",
        "The header Admin navigation link remains visible only for admins (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Use the authorization-backed admin detection hook (useIsCallerAdmin) to conditionally render the QuickRequestsAdminView only when admin status is determined and true, so non-admin visitors never mount the admin section. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Confirm the Admin navigation button remains gated by confirmed admin status (avoid showing while admin status is unknown/loading) to prevent regression of admin-only visibility. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure getAllRequests() is only executed after admin status is known and true by gating the React Query requests query.",
      "acceptanceCriteria": [
        "`getAllRequests()` is not called unless admin status has been determined and is true.",
        "React Query no longer enters an error state for the requests query on non-admin sessions.",
        "Admin sessions can still refresh/reload and successfully refetch requests."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin requests query hook to support an explicit enabled condition (or a dedicated admin-only hook) so actor.getAllRequests() runs only when admin status is confirmed true (and actor is ready), preventing non-admin/anonymous calls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/QuickRequestsAdminView.tsx",
          "operation": "modify",
          "description": "Integrate useIsCallerAdmin into the admin requests view and pass an admin-only enabled flag into the requests query so getAllRequests() is never invoked for non-admins; keep the existing shadcn-ui Card/Button UI structure without modifying files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Improve admin requests error handling with clearer English messages, safe diagnostic details, and an actionable hint about caffeineAdminToken when access is denied.",
      "acceptanceCriteria": [
        "If access is denied, the UI displays an 'Access Denied' message and includes a hint that admin access requires the `caffeineAdminToken` URL parameter (do not display any actual secret token value).",
        "If another error happens (e.g., network/canister call failure), the UI displays a general failure message and also shows the raw error message text in a secondary/diagnostic line for troubleshooting.",
        "User-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/QuickRequestsAdminView.tsx",
          "operation": "modify",
          "description": "Enhance the shadcn-ui Card-based error state to (1) detect access-denied cases and show an 'Access Denied' message plus a hint about requiring the caffeineAdminToken URL parameter (no token values), and (2) for other errors show a general failure message plus a secondary diagnostic line with the raw error message text (safely rendered as plain text). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}